#include "stdafx.h"
#include "NormalStage.h"

HRESULT NormalStage::init()
{
	/*====================================================================
		스테이지의 배경 이미지를 설정하고, 카메라에게 맵 사이즈를 알려 줍니다.
	====================================================================*/
	backGround = IMG_M->findImage("normalStage");
	CAMERA_M->SetMap(*this, backGround);

	/*====================================================================
		오브젝트와 에너미를 배치합니다.
	====================================================================*/

	/*====================================================================
		스테이지 진입 시 실행 될 이벤트를 추가합니다.
	====================================================================*/

	return S_OK;
}

void NormalStage::release()
{
}

void NormalStage::update()
{
}

void NormalStage::render()
{
}
