#include "stdafx.h"
#include "ShopScene.h"

HRESULT ShopScene::init()
{
	/*====================================================================
		상점 씬에서 입장에 연출을 진행합니다.
	====================================================================*/

	/*====================================================================
		맵의 사이즈를 지정합니다.
	====================================================================*/
	_background = IMG_M->findImage("shop_background");
	CAMERA_M->SetMap(*this, WINSIZEX, WINSIZEY);

	/*====================================================================
		UI 이미지를 연출합니다.
	====================================================================*/

	/*====================================================================
		이벤트를 실행합니다.
	====================================================================*/


	return S_OK;
}

void ShopScene::release()
{
}

void ShopScene::update()
{
	CAMERA_M->SetPos(WINSIZEX/2, WINSIZEY/2);
}

void ShopScene::render()
{
	_background->render(getMapDC());
}
